app/controllers/appointments_controller.rb

    def create
      @date = JSON.parse(request.body.read)['appointment']
      @date = Date.parse(@date)
      # @appointment = Appointment.where("appointment like ?", @date).first

      @appointment = Appointment.where(appointment: params[:appointment])

      if @appointment.present?
        render json: {"Message":"Appointmente already exists"}
      else
        @appointment = Appointment.new(appointment: @date)
          if @appointment.save
---
SELECT  "appointments".* FROM "appointments" WHERE (appointment like '2019-03-22') ORDER BY "appointments"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."appointment" = ?  [["appointment", "2019-03-22"]]
INSERT INTO "appointments" ("appointment", "created_at", "updated_at") VALUES (?, ?, ?)  [["appointment", "2019-03-23"], ["created_at", "2019-03-14 10:38:36.552275"], ["updated_at", "2019-03-14 10:38:36.552275"]]

    def assignappointment
      @user = User.find(params[:user_id])
      @appointment = Appointment.where(appointment: params[:appointment]).first

      if @appointment.present?
        if @appointment.users.include?(@user)
          render json: {"Message":"Already exists user in appointment"}
        else
          @appointment.users << @user
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."appointment" = ?  [["appointment", "2019-03-23"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "appointments_users" ON "users"."id" = "appointments_users"."user_id" WHERE "appointments_users"."appointment_id" = ? AND "users"."id" = ? LIMIT ?  [["appointment_id", 6], ["id", 2], ["LIMIT", 1]]
INSERT INTO "appointments" ("appointment", "created_at", "updated_at") VALUES (?, ?, ?)  [["appointment", "2019-03-23"], ["created_at", "2019-03-14 09:18:12.532255"], ["updated_at", "2019-03-14 09:18:12.532255"]]

    def unassignappointment
      @user = User.find(params[:user_id])
      @appointment = Appointment.where(appointment: params[:appointment]).first

      if @appointment.present?
        if @appointment.users.include?(@user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."appointment" = ?  [["appointment", "2019-03-23"]]
SELECT  1 AS one FROM "users" INNER JOIN "appointments_users" ON "users"."id" = "appointments_users"."user_id" WHERE "appointments_users"."appointment_id" = ? AND "users"."id" = ? LIMIT ?  [["appointment_id", 6], ["id", 2], ["LIMIT", 1]]

    def destroy
      if @appointment.destroy
---
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 6]]