app/controllers/articles_controller.rb

UPDATE "articles" SET "visits_count" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["visits_count", 1], ["updated_at", "2019-03-09 04:09:29.697328"], ["id", 1]]
---
  def show
    @article.update_visits

INSERT INTO "articles" ("title", "body", "visits_count", "url", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(article_params)

    if @article.save

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 6]]
---
  def destroy
    if @article.destroy