app/controllers/authentication_controller.rb

    def authenticate
    command = AuthenticateUser.call(params[:email], params[:password])
    user = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "admin@example.com.co"], ["LIMIT", 1]]