app/controllers/careers_controller.rb

  def index
    @careers = Career.all
---
SELECT "careers".* FROM "careers"

  def create
    @career = career.new(career_params)

    if @career.save
---
INSERT INTO "careers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Ciencias de la Computación"], ["created_at", "2019-03-08 21:36:42.790186"], ["updated_at", "2019-03-08 21:36:42.790186"]]

    def set_career
      @career = Career.find(params[:id])
---
SELECT  "careers".* FROM "careers" WHERE "careers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]