app/controllers/passwords_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "bjmorenon@unal.edu.co"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = ? AND "users"."id" != ? LIMIT ?  [["email", "bjmorenon@unal.edu.co"], ["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "jucrodriguezpu@unal.edu.co"], ["LIMIT", 1]]
---
    def forgot
        if params[:email].blank?
          return render json: {error: 'Email not present'}
        end
        email = params[:email]
        user = User.find_by(email: email.downcase)

        if user.present?

SELECT  "users".* FROM "users" WHERE "users"."reset_password_token" = ? LIMIT ?  [["reset_password_token", ""], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."reset_password_token" = ? LIMIT ?  [["reset_password_token", "70e6c96b71a77d9c3f2d"], ["LIMIT", 1]]
---
    def reset
        token = params[:token].to_s

        if params[:email].blank?
          return render json: {error: 'Token not present'}
        end

        user = User.find_by(reset_password_token: token)

        if user.present? && user.password_token_valid?

SELECT  "users".* FROM "users" WHERE "users"."reset_password_token" = ? LIMIT ?  [["reset_password_token", "5e6ecd64ad5aaf24d57c"], ["LIMIT", 1]]
---
  def update
      if !params[:password].present?
        render json: {error: 'Password not present'}, status: :unprocessable_entity
        return
      end
      token = params[:token].to_s
      user = User.find_by(reset_password_token: token)