app/controllers/professors_controller.rb

  def index
      @professors = User.where(role_id: 1)
---
SELECT "users".* FROM "users" WHERE "users"."role_id" = ?  [["role_id", 1]]

  def show
     @professor = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def showbyname
    @professor = User.where("name like ? AND role_id=1) OR (last_name like ? AND role_id=1", params[:name], params[:last_name])

     if @professor.empty?
---
SELECT "users".* FROM "users" WHERE (name like ''Iván'%')
SELECT  1 AS one FROM "users" WHERE (name like '%Yesid%' AND role_id=1) OR (last_name like '%Castellanos%' AND role_id=1) LIMIT ?  [["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE (name like '%Yesid%' AND role_id=1) OR (last_name like '%Castellanos%' AND role_id=1)

    def set_professor
      @professor = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]