app/controllers/subjects_controller.rb

SELECT "subjects".* FROM "subjects" WHERE (name like '%Ruby%')
SELECT  1 AS one FROM "subjects" WHERE (name like '%Ruby%') LIMIT ?  [["LIMIT", 1]]
---
  def showbyname
    @subjects = Subject.where("name like ?", params[:name])

     if @subjects.empty?

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "subjects".* FROM "subjects" WHERE (name like 'Programación Ruby') ORDER BY "subjects"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "subjects".* FROM "subjects" WHERE (name like 'Programación Ruby')
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "users".* FROM "users" INNER JOIN "subjects_users" ON "users"."id" = "subjects_users"."user_id" WHERE "subjects_users"."subject_id" = ? AND "users"."id" = ? LIMIT ?  [["subject_id", 1], ["id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "subjects_users" ON "users"."id" = "subjects_users"."user_id" WHERE "subjects_users"."subject_id" = ? AND "users"."id" = ? LIMIT ?  [["subject_id", 1], ["id", 3], ["LIMIT", 1]]
INSERT INTO "subjects" ("name", "summary", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.find(params[:user_id])
    @subject = Subject.where("name like ?", params[:name]).first

    if @subject.present?
      if @subject.users.include?(@user)
        render json: {"Message":"Already exists user in subject"}
      else
        @subject.users << @user
        render json: @subject.as_json(except: [:user_id]), status: :accepted, location: @subject
      end
    else
      @subject = Subject.new(subject_params)

      if @subject.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "subjects".* FROM "subjects" WHERE (name like '%Programación Ruby%') ORDER BY "subjects"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "subjects_users" ON "users"."id" = "subjects_users"."user_id" WHERE "subjects_users"."subject_id" = ? AND "users"."id" = ? LIMIT ?  [["subject_id", 1], ["id", 3], ["LIMIT", 1]]
---
  def unassignsubject
    @user = User.find(params[:user_id])
    @subject = Subject.where("name like ?", params[:name]).first

    if @subject.present?
      if @subject.users.include?(@user)

DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 2]]
---
  def destroy
    if @subject.destroy