app/controllers/tutorials_controller.rb

SELECT "tutorials".* FROM "tutorials"
---
  def index
      @tutorials = Tutorial.all

INSERT INTO "tutorials" ("appointment", "created_at", "updated_at", "user_id", "professor_id", "subject_id") VALUES (?, ?, ?, ?, ?, ?)  [["appointment", "2018-03-19"], ["created_at", "2019-03-14 11:26:25.054493"], ["updated_at", "2019-03-14 11:26:25.054493"], ["user_id", 4], ["professor_id", 3], ["subject_id", 1]]
---
  def create
    @tutorial = Tutorial.new(tutorial_params)
    if @tutorial.save

SELECT  "tutorials".* FROM "tutorials" WHERE "tutorials"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tutorials" SET "accepted" = ?, "updated_at" = ? WHERE "tutorials"."id" = ?  [["accepted", 1], ["updated_at", "2019-03-14 11:32:35.198764"], ["id", 1]]
---
  def update
    @tutorial = Tutorial.find(params[:id])
    if @tutorial.update(tutorial_params)

SELECT  "tutorials".* FROM "tutorials" WHERE "tutorials"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_tutorial
      @tutorial = Tutorial.find(params[:id])