app/models/article.rb

UPDATE "articles" SET "visits_count" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["visits_count", 1], ["updated_at", "2019-03-09 04:09:29.697328"], ["id", 1]]
---
    def update_visits
       self.update(visualizations: (self.visualizations.to_i + 1).to_s)